luvea/TC277_RobotCtrl_Fan/Aurix_MC-ISAR/general/tricore/inc/TC27xC/IfxScu_bf.h
/** \brief  Offset for Ifx_SCU_ESROCFG_Bits.ARC */
#define IFX_SCU_ESROCFG_ARC_OFF (1u)

/** \brief  Length for Ifx_SCU_ESROCFG_Bits.ARI */
#define IFX_SCU_ESROCFG_ARI_LEN (1u)

/** \brief  Mask for Ifx_SCU_ESROCFG_Bits.ARI */
#define IFX_SCU_ESROCFG_ARI_MSK (0x1u)

/** \brief  Offset for Ifx_SCU_ESROCFG_Bits.ARI */
#define IFX_SCU_ESROCFG_ARI_OFF (0u)

/** \brief  Length for Ifx_SCU_EVR13CON_Bits.BPEVR13OFF */
#define IFX_SCU_EVR13CON_BPEVR13OFF_LEN (1u)

/** \brief  Mask for Ifx_SCU_EVR13CON_Bits.BPEVR13OFF */
#define IFX_SCU_EVR13CON_BPEVR13OFF_MSK (0x1u)

/** \brief  Offset for Ifx_SCU_EVR13CON_Bits.BPEVR13OFF */
#define IFX_SCU_EVR13CON_BPEVR13OFF_OFF (29u)

/** \brief  Length for Ifx_SCU_EVR13CON_Bits.EVR13OFF */
#define IFX_SCU_EVR13CON_EVR13OFF_LEN (1u)

/** \brief  Mask for Ifx_SCU_EVR13CON_Bits.EVR13OFF */
#define IFX_SCU_EVR13CON_EVR13OFF_MSK (0x1u)

/** \brief  Offset for Ifx_SCU_EVR13CON_Bits.EVR13OFF */
#define IFX_SCU_EVR13CON_EVR13OFF_OFF (28u)

/** \brief  Length for Ifx_SCU_EVR13CON_Bits.LCK */
#define IFX_SCU_EVR13CON_LCK_LEN (1u)

/** \brief  Mask for Ifx_SCU_EVR13CON_Bits.LCK */
#define IFX_SCU_EVR13CON_LCK_MSK (0x1u)

/** \brief  Offset for Ifx_SCU_EVR13CON_Bits.LCK */
#define IFX_SCU_EVR13CON_LCK_OFF (31u)

/** \brief  Length for Ifx_SCU_EVR33CON_Bits.BPEVR33OFF */
#define IFX_SCU_EVR33CON_BPEVR33OFF_LEN (1u)

/** \brief  Mask for Ifx_SCU_EVR33CON_Bits.BPEVR33OFF */
#define IFX_SCU_EVR33CON_BPEVR33OFF_MSK (0x1u)

/** \brief  Offset for Ifx_SCU_EVR33CON_Bits.BPEVR33OFF */
#define IFX_SCU_EVR33CON_BPEVR33OFF_OFF (29u)

/** \brief  Length for Ifx_SCU_EVR33CON_Bits.EVR33OFF */
#define IFX_SCU_EVR33CON_EVR33OFF_LEN (1u)

/** \brief  Mask for Ifx_SCU_EVR33CON_Bits.EVR33OFF */
#define IFX_SCU_EVR33CON_EVR33OFF_MSK (0x1u)

/** \brief  Offset for Ifx_SCU_EVR33CON_Bits.EVR33OFF */
#define IFX_SCU_EVR33CON_EVR33OFF_OFF (28u)

/** \brief  Length for Ifx_SCU_EVR33CON_Bits.LCK */
#define IFX_SCU_EVR33CON_LCK_LEN (1u)

/** \brief  Mask for Ifx_SCU_EVR33CON_Bits.LCK */
#define IFX_SCU_EVR33CON_LCK_MSK (0x1u)

/** \brief  Offset for Ifx_SCU_EVR33CON_Bits.LCK */
#define IFX_SCU_EVR33CON_LCK_OFF (31u)

/** \brief  Length for Ifx_SCU_EVRADCSTAT_Bits.ADC13V */
#define IFX_SCU_EVRADCSTAT_ADC13V_LEN (8u)

/** \brief  Mask for Ifx_SCU_EVRADCSTAT_Bits.ADC13V */
#define IFX_SCU_EVRADCSTAT_ADC13V_MSK (0xffu)

/** \brief  Offset for Ifx_SCU_EVRADCSTAT_Bits.ADC13V */
#define IFX_SCU_EVRADCSTAT_ADC13V_OFF (0u)

/** \brief  Length for Ifx_SCU_EVRADCSTAT_Bits.ADC33V */
#define IFX_SCU_EVRADCSTAT_ADC33V_LEN (8u)

/** \brief  Mask for Ifx_SCU_EVRADCSTAT_Bits.ADC33V */
#define IFX_SCU_EVRADCSTAT_ADC33V_MSK (0xffu)

/** \brief  Offset for Ifx_SCU_EVRADCSTAT_Bits.ADC33V */
#define IFX_SCU_EVRADCSTAT_ADC33V_OFF (8u)

/** \brief  Length for Ifx_SCU_EVRADCSTAT_Bits.ADCSWDV */
#define IFX_SCU_EVRADCSTAT_ADCSWDV_LEN (8u)

/** \brief  Mask for Ifx_SCU_EVRADCSTAT_Bits.ADCSWDV */
#define IFX_SCU_EVRADCSTAT_ADCSWDV_MSK (0xffu)

/** \brief  Offset for Ifx_SCU_EVRADCSTAT_Bits.ADCSWDV */
#define IFX_SCU_EVRADCSTAT_ADCSWDV_OFF (16u)

/** \brief  Length for Ifx_SCU_EVRADCSTAT_Bits.VAL */
#define IFX_SCU_EVRADCSTAT_VAL_LEN (1u)

/** \brief  Mask for Ifx_SCU_EVRADCSTAT_Bits.VAL */
#define IFX_SCU_EVRADCSTAT_VAL_MSK (0x1u)

/** \brief  Offset for Ifx_SCU_EVRADCSTAT_Bits.VAL */
#define IFX_SCU_EVRADCSTAT_VAL_OFF (31u)

/** \brief  Length for Ifx_SCU_EVRDVSTAT_Bits.DVS13TRIM */
#define IFX_SCU_EVRDVSTAT_DVS13TRIM_LEN (8u)

/** \brief  Mask for Ifx_SCU_EVRDVSTAT_Bits.DVS13TRIM */
#define IFX_SCU_EVRDVSTAT_DVS13TRIM_MSK (0xffu)

/** \brief  Offset for Ifx_SCU_EVRDVSTAT_Bits.DVS13TRIM */
#define IFX_SCU_EVRDVSTAT_DVS13TRIM_OFF (0u)

/** \brief  Length for Ifx_SCU_EVRDVSTAT_Bits.DVS33TRIM */
#define IFX_SCU_EVRDVSTAT_DVS33TRIM_LEN (8u)

/** \brief  Mask for Ifx_SCU_EVRDVSTAT_Bits.DVS33TRIM */
#define IFX_SCU_EVRDVSTAT_DVS33TRIM_MSK (0xffu)

/** \brief  Offset for Ifx_SCU_EVRDVSTAT_Bits.DVS33TRIM */
#define IFX_SCU_EVRDVSTAT_DVS33TRIM_OFF (16u)

/** \brief  Length for Ifx_SCU_EVRDVSTAT_Bits.VAL */
#define IFX_SCU_EVRDVSTAT_VAL_LEN (1u)

/** \brief  Mask for Ifx_SCU_EVRDVSTAT_Bits.VAL */
#define IFX_SCU_EVRDVSTAT_VAL_MSK (0x1u)

/** \brief  Offset for Ifx_SCU_EVRDVSTAT_Bits.VAL */
#define IFX_SCU_EVRDVSTAT_VAL_OFF (31u)

/** \brief  Length for Ifx_SCU_EVRMONCTRL_Bits.EVR13OVMOD */
#define IFX_SCU_EVRMONCTRL_EVR13OVMOD_LEN (2u)

/** \brief  Mask for Ifx_SCU_EVRMONCTRL_Bits.EVR13OVMOD */
#define IFX_SCU_EVRMONCTRL_EVR13OVMOD_MSK (0x3u)

/** \brief  Offset for Ifx_SCU_EVRMONCTRL_Bits.EVR13OVMOD */
#define IFX_SCU_EVRMONCTRL_EVR13OVMOD_OFF (0u)

/** \brief  Length for Ifx_SCU_EVRMONCTRL_Bits.EVR13UVMOD */
#define IFX_SCU_EVRMONCTRL_EVR13UVMOD_LEN (2u)

/** \brief  Mask for Ifx_SCU_EVRMONCTRL_Bits.EVR13UVMOD */
#define IFX_SCU_EVRMONCTRL_EVR13UVMOD_MSK (0x3u)

/** \brief  Offset for Ifx_SCU_EVRMONCTRL_Bits.EVR13UVMOD */
#define IFX_SCU_EVRMONCTRL_EVR13UVMOD_OFF (4u)

/** \brief  Length for Ifx_SCU_EVRMONCTRL_Bits.EVR33OVMOD */
#define IFX_SCU_EVRMONCTRL_EVR33OVMOD_LEN (2u)

/** \brief  Mask for Ifx_SCU_EVRMONCTRL_Bits.EVR33OVMOD */
#define IFX_SCU_EVRMONCTRL_EVR33OVMOD_MSK (0x3u)

/** \brief  Offset for Ifx_SCU_EVRMONCTRL_Bits.EVR33OVMOD */
#define IFX_SCU_EVRMONCTRL_EVR33OVMOD_OFF (8u)

/** \brief  Length for Ifx_SCU_EVRMONCTRL_Bits.EVR33UVMOD */
#define IFX_SCU_EVRMONCTRL_EVR33UVMOD_LEN (2u)

/** \brief  Mask for Ifx_SCU_EVRMONCTRL_Bits.EVR33UVMOD */
#define IFX_SCU_EVRMONCTRL_EVR33UVMOD_MSK (0x3u)

/** \brief  Offset for Ifx_SCU_EVRMONCTRL_Bits.EVR33UVMOD */
#define IFX_SCU_EVRMONCTRL_EVR33UVMOD_OFF (12u)

/** \brief  Length for Ifx_SCU_EVRMONCTRL_Bits.SLCK */
#define IFX_SCU_EVRMONCTRL_SLCK_LEN (1u)

/** \brief  Mask for Ifx_SCU_EVRMONCTRL_Bits.SLCK */
#define IFX_SCU_EVRMONCTRL_SLCK_MSK (0x1u)

/** \brief  Offset for Ifx_SCU_EVRMONCTRL_Bits.SLCK */
#define IFX_SCU_EVRMONCTRL_SLCK_OFF (30u)

/** \brief  Length for Ifx_SCU_EVRMONCTRL_Bits.SWDOVMOD */
#define IFX_SCU_EVRMONCTRL_SWDOVMOD_LEN (2u)

/** \brief  Mask for Ifx_SCU_EVRMONCTRL_Bits.SWDOVMOD */
#define IFX_SCU_EVRMONCTRL_SWDOVMOD_MSK (0x3u)

/** \brief  Offset for Ifx_SCU_EVRMONCTRL_Bits.SWDOVMOD */
#define IFX_SCU_EVRMONCTRL_SWDOVMOD_OFF (16u)

/** \brief  Length for Ifx_SCU_EVRMONCTRL_Bits.SWDUVMOD */
#define IFX_SCU_EVRMONCTRL_SWDUVMOD_LEN (2u)

/** \brief  Mask for Ifx_SCU_EVRMONCTRL_Bits.SWDUVMOD */
#define IFX_SCU_EVRMONCTRL_SWDUVMOD_MSK (0x3u)

/** \brief  Offset for Ifx_SCU_EVRMONCTRL_Bits.SWDUVMOD */
#define IFX_SCU_EVRMONCTRL_SWDUVMOD_OFF (20u)

/** \brief  Length for Ifx_SCU_EVROVMON_Bits.EVR13OVVAL */
#define IFX_SCU_EVROVMON_EVR13OVVAL_LEN (8u)

/** \brief  Mask for Ifx_SCU_EVROVMON_Bits.EVR13OVVAL */
#define IFX_SCU_EVROVMON_EVR13OVVAL_MSK (0xffu)

/** \brief  Offset for Ifx_SCU_EVROVMON_Bits.EVR13OVVAL */
#define IFX_SCU_EVROVMON_EVR13OVVAL_OFF (0u)

