luvea/TC277_RobotCtrl_Fan/Aurix_MC-ISAR/general/tricore/inc/TC27xC/IfxScu_bf.h
/** \brief  Length for Ifx_SCU_EVRSDCOEFF2_Bits.SD33P */
#define IFX_SCU_EVRSDCOEFF2_SD33P_LEN (8u)

/** \brief  Mask for Ifx_SCU_EVRSDCOEFF2_Bits.SD33P */
#define IFX_SCU_EVRSDCOEFF2_SD33P_MSK (0xffu)

/** \brief  Offset for Ifx_SCU_EVRSDCOEFF2_Bits.SD33P */
#define IFX_SCU_EVRSDCOEFF2_SD33P_OFF (0u)

/** \brief  Length for Ifx_SCU_EVRSDCOEFF3_Bits.CT5REG0 */
#define IFX_SCU_EVRSDCOEFF3_CT5REG0_LEN (8u)

/** \brief  Mask for Ifx_SCU_EVRSDCOEFF3_Bits.CT5REG0 */
#define IFX_SCU_EVRSDCOEFF3_CT5REG0_MSK (0xffu)

/** \brief  Offset for Ifx_SCU_EVRSDCOEFF3_Bits.CT5REG0 */
#define IFX_SCU_EVRSDCOEFF3_CT5REG0_OFF (0u)

/** \brief  Length for Ifx_SCU_EVRSDCOEFF3_Bits.CT5REG1 */
#define IFX_SCU_EVRSDCOEFF3_CT5REG1_LEN (8u)

/** \brief  Mask for Ifx_SCU_EVRSDCOEFF3_Bits.CT5REG1 */
#define IFX_SCU_EVRSDCOEFF3_CT5REG1_MSK (0xffu)

/** \brief  Offset for Ifx_SCU_EVRSDCOEFF3_Bits.CT5REG1 */
#define IFX_SCU_EVRSDCOEFF3_CT5REG1_OFF (8u)

/** \brief  Length for Ifx_SCU_EVRSDCOEFF3_Bits.CT5REG2 */
#define IFX_SCU_EVRSDCOEFF3_CT5REG2_LEN (8u)

/** \brief  Mask for Ifx_SCU_EVRSDCOEFF3_Bits.CT5REG2 */
#define IFX_SCU_EVRSDCOEFF3_CT5REG2_MSK (0xffu)

/** \brief  Offset for Ifx_SCU_EVRSDCOEFF3_Bits.CT5REG2 */
#define IFX_SCU_EVRSDCOEFF3_CT5REG2_OFF (16u)

/** \brief  Length for Ifx_SCU_EVRSDCOEFF3_Bits.LCK */
#define IFX_SCU_EVRSDCOEFF3_LCK_LEN (1u)

/** \brief  Mask for Ifx_SCU_EVRSDCOEFF3_Bits.LCK */
#define IFX_SCU_EVRSDCOEFF3_LCK_MSK (0x1u)

/** \brief  Offset for Ifx_SCU_EVRSDCOEFF3_Bits.LCK */
#define IFX_SCU_EVRSDCOEFF3_LCK_OFF (31u)

/** \brief  Length for Ifx_SCU_EVRSDCOEFF4_Bits.CT5REG3 */
#define IFX_SCU_EVRSDCOEFF4_CT5REG3_LEN (8u)

/** \brief  Mask for Ifx_SCU_EVRSDCOEFF4_Bits.CT5REG3 */
#define IFX_SCU_EVRSDCOEFF4_CT5REG3_MSK (0xffu)

/** \brief  Offset for Ifx_SCU_EVRSDCOEFF4_Bits.CT5REG3 */
#define IFX_SCU_EVRSDCOEFF4_CT5REG3_OFF (0u)

/** \brief  Length for Ifx_SCU_EVRSDCOEFF4_Bits.CT5REG4 */
#define IFX_SCU_EVRSDCOEFF4_CT5REG4_LEN (8u)

/** \brief  Mask for Ifx_SCU_EVRSDCOEFF4_Bits.CT5REG4 */
#define IFX_SCU_EVRSDCOEFF4_CT5REG4_MSK (0xffu)

/** \brief  Offset for Ifx_SCU_EVRSDCOEFF4_Bits.CT5REG4 */
#define IFX_SCU_EVRSDCOEFF4_CT5REG4_OFF (8u)

/** \brief  Length for Ifx_SCU_EVRSDCOEFF4_Bits.LCK */
#define IFX_SCU_EVRSDCOEFF4_LCK_LEN (1u)

/** \brief  Mask for Ifx_SCU_EVRSDCOEFF4_Bits.LCK */
#define IFX_SCU_EVRSDCOEFF4_LCK_MSK (0x1u)

/** \brief  Offset for Ifx_SCU_EVRSDCOEFF4_Bits.LCK */
#define IFX_SCU_EVRSDCOEFF4_LCK_OFF (31u)

/** \brief  Length for Ifx_SCU_EVRSDCOEFF5_Bits.CT33REG0 */
#define IFX_SCU_EVRSDCOEFF5_CT33REG0_LEN (8u)

/** \brief  Mask for Ifx_SCU_EVRSDCOEFF5_Bits.CT33REG0 */
#define IFX_SCU_EVRSDCOEFF5_CT33REG0_MSK (0xffu)

/** \brief  Offset for Ifx_SCU_EVRSDCOEFF5_Bits.CT33REG0 */
#define IFX_SCU_EVRSDCOEFF5_CT33REG0_OFF (0u)

/** \brief  Length for Ifx_SCU_EVRSDCOEFF5_Bits.CT33REG1 */
#define IFX_SCU_EVRSDCOEFF5_CT33REG1_LEN (8u)

/** \brief  Mask for Ifx_SCU_EVRSDCOEFF5_Bits.CT33REG1 */
#define IFX_SCU_EVRSDCOEFF5_CT33REG1_MSK (0xffu)

/** \brief  Offset for Ifx_SCU_EVRSDCOEFF5_Bits.CT33REG1 */
#define IFX_SCU_EVRSDCOEFF5_CT33REG1_OFF (8u)

/** \brief  Length for Ifx_SCU_EVRSDCOEFF5_Bits.CT33REG2 */
#define IFX_SCU_EVRSDCOEFF5_CT33REG2_LEN (8u)

/** \brief  Mask for Ifx_SCU_EVRSDCOEFF5_Bits.CT33REG2 */
#define IFX_SCU_EVRSDCOEFF5_CT33REG2_MSK (0xffu)

/** \brief  Offset for Ifx_SCU_EVRSDCOEFF5_Bits.CT33REG2 */
#define IFX_SCU_EVRSDCOEFF5_CT33REG2_OFF (16u)

/** \brief  Length for Ifx_SCU_EVRSDCOEFF5_Bits.LCK */
#define IFX_SCU_EVRSDCOEFF5_LCK_LEN (1u)

/** \brief  Mask for Ifx_SCU_EVRSDCOEFF5_Bits.LCK */
#define IFX_SCU_EVRSDCOEFF5_LCK_MSK (0x1u)

/** \brief  Offset for Ifx_SCU_EVRSDCOEFF5_Bits.LCK */
#define IFX_SCU_EVRSDCOEFF5_LCK_OFF (31u)

/** \brief  Length for Ifx_SCU_EVRSDCOEFF6_Bits.CT33REG3 */
#define IFX_SCU_EVRSDCOEFF6_CT33REG3_LEN (8u)

/** \brief  Mask for Ifx_SCU_EVRSDCOEFF6_Bits.CT33REG3 */
#define IFX_SCU_EVRSDCOEFF6_CT33REG3_MSK (0xffu)

/** \brief  Offset for Ifx_SCU_EVRSDCOEFF6_Bits.CT33REG3 */
#define IFX_SCU_EVRSDCOEFF6_CT33REG3_OFF (0u)

/** \brief  Length for Ifx_SCU_EVRSDCOEFF6_Bits.CT33REG4 */
#define IFX_SCU_EVRSDCOEFF6_CT33REG4_LEN (8u)

/** \brief  Mask for Ifx_SCU_EVRSDCOEFF6_Bits.CT33REG4 */
#define IFX_SCU_EVRSDCOEFF6_CT33REG4_MSK (0xffu)

/** \brief  Offset for Ifx_SCU_EVRSDCOEFF6_Bits.CT33REG4 */
#define IFX_SCU_EVRSDCOEFF6_CT33REG4_OFF (8u)

/** \brief  Length for Ifx_SCU_EVRSDCOEFF6_Bits.LCK */
#define IFX_SCU_EVRSDCOEFF6_LCK_LEN (1u)

/** \brief  Mask for Ifx_SCU_EVRSDCOEFF6_Bits.LCK */
#define IFX_SCU_EVRSDCOEFF6_LCK_MSK (0x1u)

/** \brief  Offset for Ifx_SCU_EVRSDCOEFF6_Bits.LCK */
#define IFX_SCU_EVRSDCOEFF6_LCK_OFF (31u)

/** \brief  Length for Ifx_SCU_EVRSDCTRL1_Bits.LCK */
#define IFX_SCU_EVRSDCTRL1_LCK_LEN (1u)

/** \brief  Mask for Ifx_SCU_EVRSDCTRL1_Bits.LCK */
#define IFX_SCU_EVRSDCTRL1_LCK_MSK (0x1u)

/** \brief  Offset for Ifx_SCU_EVRSDCTRL1_Bits.LCK */
#define IFX_SCU_EVRSDCTRL1_LCK_OFF (31u)

/** \brief  Length for Ifx_SCU_EVRSDCTRL1_Bits.SDFREQ */
#define IFX_SCU_EVRSDCTRL1_SDFREQ_LEN (8u)

/** \brief  Mask for Ifx_SCU_EVRSDCTRL1_Bits.SDFREQ */
#define IFX_SCU_EVRSDCTRL1_SDFREQ_MSK (0xffu)

/** \brief  Offset for Ifx_SCU_EVRSDCTRL1_Bits.SDFREQ */
#define IFX_SCU_EVRSDCTRL1_SDFREQ_OFF (16u)

/** \brief  Length for Ifx_SCU_EVRSDCTRL1_Bits.SDFREQSPRD */
#define IFX_SCU_EVRSDCTRL1_SDFREQSPRD_LEN (16u)

/** \brief  Mask for Ifx_SCU_EVRSDCTRL1_Bits.SDFREQSPRD */
#define IFX_SCU_EVRSDCTRL1_SDFREQSPRD_MSK (0xffffu)

/** \brief  Offset for Ifx_SCU_EVRSDCTRL1_Bits.SDFREQSPRD */
#define IFX_SCU_EVRSDCTRL1_SDFREQSPRD_OFF (0u)

/** \brief  Length for Ifx_SCU_EVRSDCTRL1_Bits.SDSAMPLE */
#define IFX_SCU_EVRSDCTRL1_SDSAMPLE_LEN (1u)

/** \brief  Mask for Ifx_SCU_EVRSDCTRL1_Bits.SDSAMPLE */
#define IFX_SCU_EVRSDCTRL1_SDSAMPLE_MSK (0x1u)

/** \brief  Offset for Ifx_SCU_EVRSDCTRL1_Bits.SDSAMPLE */
#define IFX_SCU_EVRSDCTRL1_SDSAMPLE_OFF (30u)

/** \brief  Length for Ifx_SCU_EVRSDCTRL1_Bits.SDSTEP */
#define IFX_SCU_EVRSDCTRL1_SDSTEP_LEN (4u)

