luvea/TC277_RobotCtrl_Fan/Aurix_MC-ISAR/general/tricore/inc/TC27xC/IfxScu_bf.h
/** \brief  Mask for Ifx_SCU_EVRSDCTRL1_Bits.SDSTEP */
#define IFX_SCU_EVRSDCTRL1_SDSTEP_MSK (0xfu)

/** \brief  Offset for Ifx_SCU_EVRSDCTRL1_Bits.SDSTEP */
#define IFX_SCU_EVRSDCTRL1_SDSTEP_OFF (24u)

/** \brief  Length for Ifx_SCU_EVRSDCTRL2_Bits.DRVN */
#define IFX_SCU_EVRSDCTRL2_DRVN_LEN (8u)

/** \brief  Mask for Ifx_SCU_EVRSDCTRL2_Bits.DRVN */
#define IFX_SCU_EVRSDCTRL2_DRVN_MSK (0xffu)

/** \brief  Offset for Ifx_SCU_EVRSDCTRL2_Bits.DRVN */
#define IFX_SCU_EVRSDCTRL2_DRVN_OFF (16u)

/** \brief  Length for Ifx_SCU_EVRSDCTRL2_Bits.DRVP */
#define IFX_SCU_EVRSDCTRL2_DRVP_LEN (8u)

/** \brief  Mask for Ifx_SCU_EVRSDCTRL2_Bits.DRVP */
#define IFX_SCU_EVRSDCTRL2_DRVP_MSK (0xffu)

/** \brief  Offset for Ifx_SCU_EVRSDCTRL2_Bits.DRVP */
#define IFX_SCU_EVRSDCTRL2_DRVP_OFF (0u)

/** \brief  Length for Ifx_SCU_EVRSDCTRL2_Bits.LCK */
#define IFX_SCU_EVRSDCTRL2_LCK_LEN (1u)

/** \brief  Mask for Ifx_SCU_EVRSDCTRL2_Bits.LCK */
#define IFX_SCU_EVRSDCTRL2_LCK_MSK (0x1u)

/** \brief  Offset for Ifx_SCU_EVRSDCTRL2_Bits.LCK */
#define IFX_SCU_EVRSDCTRL2_LCK_OFF (31u)

/** \brief  Length for Ifx_SCU_EVRSDCTRL2_Bits.SDLUT */
#define IFX_SCU_EVRSDCTRL2_SDLUT_LEN (6u)

/** \brief  Mask for Ifx_SCU_EVRSDCTRL2_Bits.SDLUT */
#define IFX_SCU_EVRSDCTRL2_SDLUT_MSK (0x3fu)

/** \brief  Offset for Ifx_SCU_EVRSDCTRL2_Bits.SDLUT */
#define IFX_SCU_EVRSDCTRL2_SDLUT_OFF (24u)

/** \brief  Length for Ifx_SCU_EVRSDCTRL2_Bits.SDMINMAXDC */
#define IFX_SCU_EVRSDCTRL2_SDMINMAXDC_LEN (8u)

/** \brief  Mask for Ifx_SCU_EVRSDCTRL2_Bits.SDMINMAXDC */
#define IFX_SCU_EVRSDCTRL2_SDMINMAXDC_MSK (0xffu)

/** \brief  Offset for Ifx_SCU_EVRSDCTRL2_Bits.SDMINMAXDC */
#define IFX_SCU_EVRSDCTRL2_SDMINMAXDC_OFF (8u)

/** \brief  Length for Ifx_SCU_EVRSDCTRL3_Bits.LCK */
#define IFX_SCU_EVRSDCTRL3_LCK_LEN (1u)

/** \brief  Mask for Ifx_SCU_EVRSDCTRL3_Bits.LCK */
#define IFX_SCU_EVRSDCTRL3_LCK_MSK (0x1u)

/** \brief  Offset for Ifx_SCU_EVRSDCTRL3_Bits.LCK */
#define IFX_SCU_EVRSDCTRL3_LCK_OFF (31u)

/** \brief  Length for Ifx_SCU_EVRSDCTRL3_Bits.SDPID */
#define IFX_SCU_EVRSDCTRL3_SDPID_LEN (8u)

/** \brief  Mask for Ifx_SCU_EVRSDCTRL3_Bits.SDPID */
#define IFX_SCU_EVRSDCTRL3_SDPID_MSK (0xffu)

/** \brief  Offset for Ifx_SCU_EVRSDCTRL3_Bits.SDPID */
#define IFX_SCU_EVRSDCTRL3_SDPID_OFF (8u)

/** \brief  Length for Ifx_SCU_EVRSDCTRL3_Bits.SDPWMPRE */
#define IFX_SCU_EVRSDCTRL3_SDPWMPRE_LEN (8u)

/** \brief  Mask for Ifx_SCU_EVRSDCTRL3_Bits.SDPWMPRE */
#define IFX_SCU_EVRSDCTRL3_SDPWMPRE_MSK (0xffu)

/** \brief  Offset for Ifx_SCU_EVRSDCTRL3_Bits.SDPWMPRE */
#define IFX_SCU_EVRSDCTRL3_SDPWMPRE_OFF (0u)

/** \brief  Length for Ifx_SCU_EVRSDCTRL3_Bits.SDVOKLVL */
#define IFX_SCU_EVRSDCTRL3_SDVOKLVL_LEN (8u)

/** \brief  Mask for Ifx_SCU_EVRSDCTRL3_Bits.SDVOKLVL */
#define IFX_SCU_EVRSDCTRL3_SDVOKLVL_MSK (0xffu)

/** \brief  Offset for Ifx_SCU_EVRSDCTRL3_Bits.SDVOKLVL */
#define IFX_SCU_EVRSDCTRL3_SDVOKLVL_OFF (16u)

/** \brief  Length for Ifx_SCU_EVRSDCTRL4_Bits.LCK */
#define IFX_SCU_EVRSDCTRL4_LCK_LEN (1u)

/** \brief  Mask for Ifx_SCU_EVRSDCTRL4_Bits.LCK */
#define IFX_SCU_EVRSDCTRL4_LCK_MSK (0x1u)

/** \brief  Offset for Ifx_SCU_EVRSDCTRL4_Bits.LCK */
#define IFX_SCU_EVRSDCTRL4_LCK_OFF (31u)

/** \brief  Length for Ifx_SCU_EVRSDCTRL4_Bits.SYNCDIV */
#define IFX_SCU_EVRSDCTRL4_SYNCDIV_LEN (3u)

/** \brief  Mask for Ifx_SCU_EVRSDCTRL4_Bits.SYNCDIV */
#define IFX_SCU_EVRSDCTRL4_SYNCDIV_MSK (0x7u)

/** \brief  Offset for Ifx_SCU_EVRSDCTRL4_Bits.SYNCDIV */
#define IFX_SCU_EVRSDCTRL4_SYNCDIV_OFF (8u)

/** \brief  Length for Ifx_SCU_EVRSTAT_Bits.BGPROK */
#define IFX_SCU_EVRSTAT_BGPROK_LEN (1u)

/** \brief  Mask for Ifx_SCU_EVRSTAT_Bits.BGPROK */
#define IFX_SCU_EVRSTAT_BGPROK_MSK (0x1u)

/** \brief  Offset for Ifx_SCU_EVRSTAT_Bits.BGPROK */
#define IFX_SCU_EVRSTAT_BGPROK_OFF (10u)

/** \brief  Length for Ifx_SCU_EVRSTAT_Bits.EVR13 */
#define IFX_SCU_EVRSTAT_EVR13_LEN (1u)

/** \brief  Mask for Ifx_SCU_EVRSTAT_Bits.EVR13 */
#define IFX_SCU_EVRSTAT_EVR13_MSK (0x1u)

/** \brief  Offset for Ifx_SCU_EVRSTAT_Bits.EVR13 */
#define IFX_SCU_EVRSTAT_EVR13_OFF (0u)

/** \brief  Length for Ifx_SCU_EVRSTAT_Bits.EVR33 */
#define IFX_SCU_EVRSTAT_EVR33_LEN (1u)

/** \brief  Mask for Ifx_SCU_EVRSTAT_Bits.EVR33 */
#define IFX_SCU_EVRSTAT_EVR33_MSK (0x1u)

/** \brief  Offset for Ifx_SCU_EVRSTAT_Bits.EVR33 */
#define IFX_SCU_EVRSTAT_EVR33_OFF (2u)

/** \brief  Length for Ifx_SCU_EVRSTAT_Bits.EXTPASS13 */
#define IFX_SCU_EVRSTAT_EXTPASS13_LEN (1u)

/** \brief  Mask for Ifx_SCU_EVRSTAT_Bits.EXTPASS13 */
#define IFX_SCU_EVRSTAT_EXTPASS13_MSK (0x1u)

/** \brief  Offset for Ifx_SCU_EVRSTAT_Bits.EXTPASS13 */
#define IFX_SCU_EVRSTAT_EXTPASS13_OFF (8u)

/** \brief  Length for Ifx_SCU_EVRSTAT_Bits.EXTPASS33 */
#define IFX_SCU_EVRSTAT_EXTPASS33_LEN (1u)

/** \brief  Mask for Ifx_SCU_EVRSTAT_Bits.EXTPASS33 */
#define IFX_SCU_EVRSTAT_EXTPASS33_MSK (0x1u)

/** \brief  Offset for Ifx_SCU_EVRSTAT_Bits.EXTPASS33 */
#define IFX_SCU_EVRSTAT_EXTPASS33_OFF (9u)

/** \brief  Length for Ifx_SCU_EVRSTAT_Bits.OV13 */
#define IFX_SCU_EVRSTAT_OV13_LEN (1u)

/** \brief  Mask for Ifx_SCU_EVRSTAT_Bits.OV13 */
#define IFX_SCU_EVRSTAT_OV13_MSK (0x1u)

/** \brief  Offset for Ifx_SCU_EVRSTAT_Bits.OV13 */
#define IFX_SCU_EVRSTAT_OV13_OFF (1u)

/** \brief  Length for Ifx_SCU_EVRSTAT_Bits.OV33 */
#define IFX_SCU_EVRSTAT_OV33_LEN (1u)

/** \brief  Mask for Ifx_SCU_EVRSTAT_Bits.OV33 */
#define IFX_SCU_EVRSTAT_OV33_MSK (0x1u)

/** \brief  Offset for Ifx_SCU_EVRSTAT_Bits.OV33 */
#define IFX_SCU_EVRSTAT_OV33_OFF (3u)

/** \brief  Length for Ifx_SCU_EVRSTAT_Bits.OVSWD */
#define IFX_SCU_EVRSTAT_OVSWD_LEN (1u)

/** \brief  Mask for Ifx_SCU_EVRSTAT_Bits.OVSWD */
#define IFX_SCU_EVRSTAT_OVSWD_MSK (0x1u)

/** \brief  Offset for Ifx_SCU_EVRSTAT_Bits.OVSWD */
#define IFX_SCU_EVRSTAT_OVSWD_OFF (4u)

/** \brief  Length for Ifx_SCU_EVRSTAT_Bits.UV13 */
#define IFX_SCU_EVRSTAT_UV13_LEN (1u)

/** \brief  Mask for Ifx_SCU_EVRSTAT_Bits.UV13 */
#define IFX_SCU_EVRSTAT_UV13_MSK (0x1u)

/** \brief  Offset for Ifx_SCU_EVRSTAT_Bits.UV13 */
#define IFX_SCU_EVRSTAT_UV13_OFF (5u)

