luvea/TC277_RobotCtrl_Fan/Aurix_MC-ISAR/general/tricore/inc/TC27xC/IfxScu_bf.h
/** \brief  Length for Ifx_SCU_EVRSTAT_Bits.UV33 */
#define IFX_SCU_EVRSTAT_UV33_LEN (1u)

/** \brief  Mask for Ifx_SCU_EVRSTAT_Bits.UV33 */
#define IFX_SCU_EVRSTAT_UV33_MSK (0x1u)

/** \brief  Offset for Ifx_SCU_EVRSTAT_Bits.UV33 */
#define IFX_SCU_EVRSTAT_UV33_OFF (6u)

/** \brief  Length for Ifx_SCU_EVRSTAT_Bits.UVSWD */
#define IFX_SCU_EVRSTAT_UVSWD_LEN (1u)

/** \brief  Mask for Ifx_SCU_EVRSTAT_Bits.UVSWD */
#define IFX_SCU_EVRSTAT_UVSWD_MSK (0x1u)

/** \brief  Offset for Ifx_SCU_EVRSTAT_Bits.UVSWD */
#define IFX_SCU_EVRSTAT_UVSWD_OFF (7u)

/** \brief  Length for Ifx_SCU_EVRTRIM_Bits.EVR13TRIM */
#define IFX_SCU_EVRTRIM_EVR13TRIM_LEN (8u)

/** \brief  Mask for Ifx_SCU_EVRTRIM_Bits.EVR13TRIM */
#define IFX_SCU_EVRTRIM_EVR13TRIM_MSK (0xffu)

/** \brief  Offset for Ifx_SCU_EVRTRIM_Bits.EVR13TRIM */
#define IFX_SCU_EVRTRIM_EVR13TRIM_OFF (0u)

/** \brief  Length for Ifx_SCU_EVRTRIM_Bits.LCK */
#define IFX_SCU_EVRTRIM_LCK_LEN (1u)

/** \brief  Mask for Ifx_SCU_EVRTRIM_Bits.LCK */
#define IFX_SCU_EVRTRIM_LCK_MSK (0x1u)

/** \brief  Offset for Ifx_SCU_EVRTRIM_Bits.LCK */
#define IFX_SCU_EVRTRIM_LCK_OFF (31u)

/** \brief  Length for Ifx_SCU_EVRTRIM_Bits.SDVOUTSEL */
#define IFX_SCU_EVRTRIM_SDVOUTSEL_LEN (8u)

/** \brief  Mask for Ifx_SCU_EVRTRIM_Bits.SDVOUTSEL */
#define IFX_SCU_EVRTRIM_SDVOUTSEL_MSK (0xffu)

/** \brief  Offset for Ifx_SCU_EVRTRIM_Bits.SDVOUTSEL */
#define IFX_SCU_EVRTRIM_SDVOUTSEL_OFF (8u)

/** \brief  Length for Ifx_SCU_EVRTRIM_Bits.SLCK */
#define IFX_SCU_EVRTRIM_SLCK_LEN (1u)

/** \brief  Mask for Ifx_SCU_EVRTRIM_Bits.SLCK */
#define IFX_SCU_EVRTRIM_SLCK_MSK (0x1u)

/** \brief  Offset for Ifx_SCU_EVRTRIM_Bits.SLCK */
#define IFX_SCU_EVRTRIM_SLCK_OFF (30u)

/** \brief  Length for Ifx_SCU_EVRUVMON_Bits.EVR13UVVAL */
#define IFX_SCU_EVRUVMON_EVR13UVVAL_LEN (8u)

/** \brief  Mask for Ifx_SCU_EVRUVMON_Bits.EVR13UVVAL */
#define IFX_SCU_EVRUVMON_EVR13UVVAL_MSK (0xffu)

/** \brief  Offset for Ifx_SCU_EVRUVMON_Bits.EVR13UVVAL */
#define IFX_SCU_EVRUVMON_EVR13UVVAL_OFF (0u)

/** \brief  Length for Ifx_SCU_EVRUVMON_Bits.EVR33UVVAL */
#define IFX_SCU_EVRUVMON_EVR33UVVAL_LEN (8u)

/** \brief  Mask for Ifx_SCU_EVRUVMON_Bits.EVR33UVVAL */
#define IFX_SCU_EVRUVMON_EVR33UVVAL_MSK (0xffu)

/** \brief  Offset for Ifx_SCU_EVRUVMON_Bits.EVR33UVVAL */
#define IFX_SCU_EVRUVMON_EVR33UVVAL_OFF (8u)

/** \brief  Length for Ifx_SCU_EVRUVMON_Bits.LCK */
#define IFX_SCU_EVRUVMON_LCK_LEN (1u)

/** \brief  Mask for Ifx_SCU_EVRUVMON_Bits.LCK */
#define IFX_SCU_EVRUVMON_LCK_MSK (0x1u)

/** \brief  Offset for Ifx_SCU_EVRUVMON_Bits.LCK */
#define IFX_SCU_EVRUVMON_LCK_OFF (31u)

/** \brief  Length for Ifx_SCU_EVRUVMON_Bits.SLCK */
#define IFX_SCU_EVRUVMON_SLCK_LEN (1u)

/** \brief  Mask for Ifx_SCU_EVRUVMON_Bits.SLCK */
#define IFX_SCU_EVRUVMON_SLCK_MSK (0x1u)

/** \brief  Offset for Ifx_SCU_EVRUVMON_Bits.SLCK */
#define IFX_SCU_EVRUVMON_SLCK_OFF (30u)

/** \brief  Length for Ifx_SCU_EVRUVMON_Bits.SWDUVVAL */
#define IFX_SCU_EVRUVMON_SWDUVVAL_LEN (8u)

/** \brief  Mask for Ifx_SCU_EVRUVMON_Bits.SWDUVVAL */
#define IFX_SCU_EVRUVMON_SWDUVVAL_MSK (0xffu)

/** \brief  Offset for Ifx_SCU_EVRUVMON_Bits.SWDUVVAL */
#define IFX_SCU_EVRUVMON_SWDUVVAL_OFF (16u)

/** \brief  Length for Ifx_SCU_EXTCON_Bits.DIV1 */
#define IFX_SCU_EXTCON_DIV1_LEN (8u)

/** \brief  Mask for Ifx_SCU_EXTCON_Bits.DIV1 */
#define IFX_SCU_EXTCON_DIV1_MSK (0xffu)

/** \brief  Offset for Ifx_SCU_EXTCON_Bits.DIV1 */
#define IFX_SCU_EXTCON_DIV1_OFF (24u)

/** \brief  Length for Ifx_SCU_EXTCON_Bits.EN0 */
#define IFX_SCU_EXTCON_EN0_LEN (1u)

/** \brief  Mask for Ifx_SCU_EXTCON_Bits.EN0 */
#define IFX_SCU_EXTCON_EN0_MSK (0x1u)

/** \brief  Offset for Ifx_SCU_EXTCON_Bits.EN0 */
#define IFX_SCU_EXTCON_EN0_OFF (0u)

/** \brief  Length for Ifx_SCU_EXTCON_Bits.EN1 */
#define IFX_SCU_EXTCON_EN1_LEN (1u)

/** \brief  Mask for Ifx_SCU_EXTCON_Bits.EN1 */
#define IFX_SCU_EXTCON_EN1_MSK (0x1u)

/** \brief  Offset for Ifx_SCU_EXTCON_Bits.EN1 */
#define IFX_SCU_EXTCON_EN1_OFF (16u)

/** \brief  Length for Ifx_SCU_EXTCON_Bits.NSEL */
#define IFX_SCU_EXTCON_NSEL_LEN (1u)

/** \brief  Mask for Ifx_SCU_EXTCON_Bits.NSEL */
#define IFX_SCU_EXTCON_NSEL_MSK (0x1u)

/** \brief  Offset for Ifx_SCU_EXTCON_Bits.NSEL */
#define IFX_SCU_EXTCON_NSEL_OFF (17u)

/** \brief  Length for Ifx_SCU_EXTCON_Bits.SEL0 */
#define IFX_SCU_EXTCON_SEL0_LEN (4u)

/** \brief  Mask for Ifx_SCU_EXTCON_Bits.SEL0 */
#define IFX_SCU_EXTCON_SEL0_MSK (0xfu)

/** \brief  Offset for Ifx_SCU_EXTCON_Bits.SEL0 */
#define IFX_SCU_EXTCON_SEL0_OFF (2u)

/** \brief  Length for Ifx_SCU_EXTCON_Bits.SEL1 */
#define IFX_SCU_EXTCON_SEL1_LEN (4u)

/** \brief  Mask for Ifx_SCU_EXTCON_Bits.SEL1 */
#define IFX_SCU_EXTCON_SEL1_MSK (0xfu)

/** \brief  Offset for Ifx_SCU_EXTCON_Bits.SEL1 */
#define IFX_SCU_EXTCON_SEL1_OFF (18u)

/** \brief  Length for Ifx_SCU_FDR_Bits.DISCLK */
#define IFX_SCU_FDR_DISCLK_LEN (1u)

/** \brief  Mask for Ifx_SCU_FDR_Bits.DISCLK */
#define IFX_SCU_FDR_DISCLK_MSK (0x1u)

/** \brief  Offset for Ifx_SCU_FDR_Bits.DISCLK */
#define IFX_SCU_FDR_DISCLK_OFF (31u)

/** \brief  Length for Ifx_SCU_FDR_Bits.DM */
#define IFX_SCU_FDR_DM_LEN (2u)

/** \brief  Mask for Ifx_SCU_FDR_Bits.DM */
#define IFX_SCU_FDR_DM_MSK (0x3u)

/** \brief  Offset for Ifx_SCU_FDR_Bits.DM */
#define IFX_SCU_FDR_DM_OFF (14u)

/** \brief  Length for Ifx_SCU_FDR_Bits.RESULT */
#define IFX_SCU_FDR_RESULT_LEN (10u)

/** \brief  Mask for Ifx_SCU_FDR_Bits.RESULT */
#define IFX_SCU_FDR_RESULT_MSK (0x3ffu)

/** \brief  Offset for Ifx_SCU_FDR_Bits.RESULT */
#define IFX_SCU_FDR_RESULT_OFF (16u)

/** \brief  Length for Ifx_SCU_FDR_Bits.STEP */
#define IFX_SCU_FDR_STEP_LEN (10u)

/** \brief  Mask for Ifx_SCU_FDR_Bits.STEP */
#define IFX_SCU_FDR_STEP_MSK (0x3ffu)

/** \brief  Offset for Ifx_SCU_FDR_Bits.STEP */
#define IFX_SCU_FDR_STEP_OFF (0u)

/** \brief  Length for Ifx_SCU_FMR_Bits.FC0 */
#define IFX_SCU_FMR_FC0_LEN (1u)

/** \brief  Mask for Ifx_SCU_FMR_Bits.FC0 */
#define IFX_SCU_FMR_FC0_MSK (0x1u)

/** \brief  Offset for Ifx_SCU_FMR_Bits.FC0 */
#define IFX_SCU_FMR_FC0_OFF (16u)

