luvea/TC277_RobotCtrl_Fan/Aurix_MC-ISAR/general/tricore/inc/TC27xC/IfxScu_bf.h
/** \brief  Mask for Ifx_SCU_PMSWCR0_Bits.PINBWKEN */
#define IFX_SCU_PMSWCR0_PINBWKEN_MSK (0x1u)

/** \brief  Offset for Ifx_SCU_PMSWCR0_Bits.PINBWKEN */
#define IFX_SCU_PMSWCR0_PINBWKEN_OFF (3u)

/** \brief  Length for Ifx_SCU_PMSWCR0_Bits.PORSTDF */
#define IFX_SCU_PMSWCR0_PORSTDF_LEN (1u)

/** \brief  Mask for Ifx_SCU_PMSWCR0_Bits.PORSTDF */
#define IFX_SCU_PMSWCR0_PORSTDF_MSK (0x1u)

/** \brief  Offset for Ifx_SCU_PMSWCR0_Bits.PORSTDF */
#define IFX_SCU_PMSWCR0_PORSTDF_OFF (23u)

/** \brief  Length for Ifx_SCU_PMSWCR0_Bits.PWRWKEN */
#define IFX_SCU_PMSWCR0_PWRWKEN_LEN (1u)

/** \brief  Mask for Ifx_SCU_PMSWCR0_Bits.PWRWKEN */
#define IFX_SCU_PMSWCR0_PWRWKEN_MSK (0x1u)

/** \brief  Offset for Ifx_SCU_PMSWCR0_Bits.PWRWKEN */
#define IFX_SCU_PMSWCR0_PWRWKEN_OFF (24u)

/** \brief  Length for Ifx_SCU_PMSWCR0_Bits.STBYRAMSEL */
#define IFX_SCU_PMSWCR0_STBYRAMSEL_LEN (2u)

/** \brief  Mask for Ifx_SCU_PMSWCR0_Bits.STBYRAMSEL */
#define IFX_SCU_PMSWCR0_STBYRAMSEL_MSK (0x3u)

/** \brief  Offset for Ifx_SCU_PMSWCR0_Bits.STBYRAMSEL */
#define IFX_SCU_PMSWCR0_STBYRAMSEL_OFF (17u)

/** \brief  Length for Ifx_SCU_PMSWCR0_Bits.TRISTEN */
#define IFX_SCU_PMSWCR0_TRISTEN_LEN (1u)

/** \brief  Mask for Ifx_SCU_PMSWCR0_Bits.TRISTEN */
#define IFX_SCU_PMSWCR0_TRISTEN_MSK (0x1u)

/** \brief  Offset for Ifx_SCU_PMSWCR0_Bits.TRISTEN */
#define IFX_SCU_PMSWCR0_TRISTEN_OFF (21u)

/** \brief  Length for Ifx_SCU_PMSWCR0_Bits.TRISTREQ */
#define IFX_SCU_PMSWCR0_TRISTREQ_LEN (1u)

/** \brief  Mask for Ifx_SCU_PMSWCR0_Bits.TRISTREQ */
#define IFX_SCU_PMSWCR0_TRISTREQ_MSK (0x1u)

/** \brief  Offset for Ifx_SCU_PMSWCR0_Bits.TRISTREQ */
#define IFX_SCU_PMSWCR0_TRISTREQ_OFF (22u)

/** \brief  Length for Ifx_SCU_PMSWCR1_Bits.CPUIDLSEL */
#define IFX_SCU_PMSWCR1_CPUIDLSEL_LEN (3u)

/** \brief  Mask for Ifx_SCU_PMSWCR1_Bits.CPUIDLSEL */
#define IFX_SCU_PMSWCR1_CPUIDLSEL_MSK (0x7u)

/** \brief  Offset for Ifx_SCU_PMSWCR1_Bits.CPUIDLSEL */
#define IFX_SCU_PMSWCR1_CPUIDLSEL_OFF (8u)

/** \brief  Length for Ifx_SCU_PMSWCR1_Bits.CPUSEL */
#define IFX_SCU_PMSWCR1_CPUSEL_LEN (3u)

/** \brief  Mask for Ifx_SCU_PMSWCR1_Bits.CPUSEL */
#define IFX_SCU_PMSWCR1_CPUSEL_MSK (0x7u)

/** \brief  Offset for Ifx_SCU_PMSWCR1_Bits.CPUSEL */
#define IFX_SCU_PMSWCR1_CPUSEL_OFF (24u)

/** \brief  Length for Ifx_SCU_PMSWCR1_Bits.IRADIS */
#define IFX_SCU_PMSWCR1_IRADIS_LEN (1u)

/** \brief  Mask for Ifx_SCU_PMSWCR1_Bits.IRADIS */
#define IFX_SCU_PMSWCR1_IRADIS_MSK (0x1u)

/** \brief  Offset for Ifx_SCU_PMSWCR1_Bits.IRADIS */
#define IFX_SCU_PMSWCR1_IRADIS_OFF (12u)

/** \brief  Length for Ifx_SCU_PMSWCR1_Bits.STBYEV */
#define IFX_SCU_PMSWCR1_STBYEV_LEN (3u)

/** \brief  Mask for Ifx_SCU_PMSWCR1_Bits.STBYEV */
#define IFX_SCU_PMSWCR1_STBYEV_MSK (0x7u)

/** \brief  Offset for Ifx_SCU_PMSWCR1_Bits.STBYEV */
#define IFX_SCU_PMSWCR1_STBYEV_OFF (28u)

/** \brief  Length for Ifx_SCU_PMSWCR1_Bits.STBYEVEN */
#define IFX_SCU_PMSWCR1_STBYEVEN_LEN (1u)

/** \brief  Mask for Ifx_SCU_PMSWCR1_Bits.STBYEVEN */
#define IFX_SCU_PMSWCR1_STBYEVEN_MSK (0x1u)

/** \brief  Offset for Ifx_SCU_PMSWCR1_Bits.STBYEVEN */
#define IFX_SCU_PMSWCR1_STBYEVEN_OFF (27u)

/** \brief  Length for Ifx_SCU_PMSWSTAT_Bits.BLNKFIL */
#define IFX_SCU_PMSWSTAT_BLNKFIL_LEN (3u)

/** \brief  Mask for Ifx_SCU_PMSWSTAT_Bits.BLNKFIL */
#define IFX_SCU_PMSWSTAT_BLNKFIL_MSK (0x7u)

/** \brief  Offset for Ifx_SCU_PMSWSTAT_Bits.BLNKFIL */
#define IFX_SCU_PMSWSTAT_BLNKFIL_OFF (24u)

/** \brief  Length for Ifx_SCU_PMSWSTAT_Bits.ESR0TRIST */
#define IFX_SCU_PMSWSTAT_ESR0TRIST_LEN (1u)

/** \brief  Mask for Ifx_SCU_PMSWSTAT_Bits.ESR0TRIST */
#define IFX_SCU_PMSWSTAT_ESR0TRIST_MSK (0x1u)

/** \brief  Offset for Ifx_SCU_PMSWSTAT_Bits.ESR0TRIST */
#define IFX_SCU_PMSWSTAT_ESR0TRIST_OFF (27u)

/** \brief  Length for Ifx_SCU_PMSWSTAT_Bits.ESR1OVRUN */
#define IFX_SCU_PMSWSTAT_ESR1OVRUN_LEN (1u)

/** \brief  Mask for Ifx_SCU_PMSWSTAT_Bits.ESR1OVRUN */
#define IFX_SCU_PMSWSTAT_ESR1OVRUN_MSK (0x1u)

/** \brief  Offset for Ifx_SCU_PMSWSTAT_Bits.ESR1OVRUN */
#define IFX_SCU_PMSWSTAT_ESR1OVRUN_OFF (3u)

/** \brief  Length for Ifx_SCU_PMSWSTAT_Bits.ESR1WKEN */
#define IFX_SCU_PMSWSTAT_ESR1WKEN_LEN (1u)

/** \brief  Mask for Ifx_SCU_PMSWSTAT_Bits.ESR1WKEN */
#define IFX_SCU_PMSWSTAT_ESR1WKEN_MSK (0x1u)

/** \brief  Offset for Ifx_SCU_PMSWSTAT_Bits.ESR1WKEN */
#define IFX_SCU_PMSWSTAT_ESR1WKEN_OFF (20u)

/** \brief  Length for Ifx_SCU_PMSWSTAT_Bits.ESR1WKP */
#define IFX_SCU_PMSWSTAT_ESR1WKP_LEN (1u)

/** \brief  Mask for Ifx_SCU_PMSWSTAT_Bits.ESR1WKP */
#define IFX_SCU_PMSWSTAT_ESR1WKP_MSK (0x1u)

/** \brief  Offset for Ifx_SCU_PMSWSTAT_Bits.ESR1WKP */
#define IFX_SCU_PMSWSTAT_ESR1WKP_OFF (2u)

/** \brief  Length for Ifx_SCU_PMSWSTAT_Bits.HWCFGEVR */
#define IFX_SCU_PMSWSTAT_HWCFGEVR_LEN (3u)

/** \brief  Mask for Ifx_SCU_PMSWSTAT_Bits.HWCFGEVR */
#define IFX_SCU_PMSWSTAT_HWCFGEVR_MSK (0x7u)

/** \brief  Offset for Ifx_SCU_PMSWSTAT_Bits.HWCFGEVR */
#define IFX_SCU_PMSWSTAT_HWCFGEVR_OFF (10u)

/** \brief  Length for Ifx_SCU_PMSWSTAT_Bits.PINAOVRUN */
#define IFX_SCU_PMSWSTAT_PINAOVRUN_LEN (1u)

/** \brief  Mask for Ifx_SCU_PMSWSTAT_Bits.PINAOVRUN */
#define IFX_SCU_PMSWSTAT_PINAOVRUN_MSK (0x1u)

/** \brief  Offset for Ifx_SCU_PMSWSTAT_Bits.PINAOVRUN */
#define IFX_SCU_PMSWSTAT_PINAOVRUN_OFF (5u)

/** \brief  Length for Ifx_SCU_PMSWSTAT_Bits.PINAWKEN */
#define IFX_SCU_PMSWSTAT_PINAWKEN_LEN (1u)

/** \brief  Mask for Ifx_SCU_PMSWSTAT_Bits.PINAWKEN */
#define IFX_SCU_PMSWSTAT_PINAWKEN_MSK (0x1u)

/** \brief  Offset for Ifx_SCU_PMSWSTAT_Bits.PINAWKEN */
#define IFX_SCU_PMSWSTAT_PINAWKEN_OFF (21u)

/** \brief  Length for Ifx_SCU_PMSWSTAT_Bits.PINAWKP */
#define IFX_SCU_PMSWSTAT_PINAWKP_LEN (1u)

/** \brief  Mask for Ifx_SCU_PMSWSTAT_Bits.PINAWKP */
#define IFX_SCU_PMSWSTAT_PINAWKP_MSK (0x1u)

/** \brief  Offset for Ifx_SCU_PMSWSTAT_Bits.PINAWKP */
#define IFX_SCU_PMSWSTAT_PINAWKP_OFF (4u)

/** \brief  Length for Ifx_SCU_PMSWSTAT_Bits.PINBOVRUN */
#define IFX_SCU_PMSWSTAT_PINBOVRUN_LEN (1u)

/** \brief  Mask for Ifx_SCU_PMSWSTAT_Bits.PINBOVRUN */
#define IFX_SCU_PMSWSTAT_PINBOVRUN_MSK (0x1u)

/** \brief  Offset for Ifx_SCU_PMSWSTAT_Bits.PINBOVRUN */
#define IFX_SCU_PMSWSTAT_PINBOVRUN_OFF (7u)

/** \brief  Length for Ifx_SCU_PMSWSTAT_Bits.PINBWKEN */
#define IFX_SCU_PMSWSTAT_PINBWKEN_LEN (1u)

/** \brief  Mask for Ifx_SCU_PMSWSTAT_Bits.PINBWKEN */
#define IFX_SCU_PMSWSTAT_PINBWKEN_MSK (0x1u)

